package javarush.JavaSyntax.lvl1.lect03;
/* Вывод на экран нескольких переменных
Объявите переменную name типа String, переменные age, height типа int.
Сразу же в строке объявления присвойте им любые разные значения.
Выведите на экран все переменные в любом порядке. Каждую с новой строки.
*/
public class task04 {
    public static void main(String[] args) {
        String age = "29";
        int height = 182;
        System.out.println(age);
        System.out.println(height);
    }
}
