package javarush.lvl1.lect03;
/* Вывод на экран переменной
Объявите переменную name типа String.
Сразу же в строке объявления присвойте ей какое-нибудь значение.
Выведите на экран переменную name.
*/
public class task02 {
    public static void main(String[] args) {
        String name = "Hello 228";
        System.out.println(name);
    }
}
